{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 1, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "batch_input_shape": [null, 33, 100, 3], "name": "batch_normalization_1", "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 16, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 2], "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "filters": 24, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "filters": 36, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "filters": 48, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [2, 2], "activation": "relu", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "filters": 48, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_size": [2, 2], "activation": "relu", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 512, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"units": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null}}]}